[[administration-indexes-equality-check-using-where-single-property-index]]
== Equality check using `WHERE` (single-property index) ==
A query containing equality comparisons of a single indexed property in the `WHERE` clause is backed automatically by the index. It is also possible for a query with multiple `OR` predicates to use multiple indexes, if indexes exist on the properties. For example, if indexes exist on both `:Label(p1)` and `:Label(p2)`, `MATCH (n:Label) WHERE n.p1 = 1 OR n.p2 = 2 RETURN n` will use both indexes. 

.Query
include::includes/administration-indexes-equality-check-using-where-single-property-index.query.adoc[]



.Query Plan
[source]
----
Compiler CYPHER 4.3

Planner COST

Runtime INTERPRETED

Runtime version 4.3

+-----------------+----------------------------------------------------------+----------------+------+---------+------------------------+
| Operator        | Details                                                  | Estimated Rows | Rows | DB Hits | Page Cache Hits/Misses |
+-----------------+----------------------------------------------------------+----------------+------+---------+------------------------+
| +ProduceResults | person                                                   |              1 |    1 |       0 |                    0/0 |
| |               +----------------------------------------------------------+----------------+------+---------+------------------------+
| +NodeIndexSeek  | person:Person(firstname) WHERE firstname = $autostring_0 |              1 |    1 |       2 |                    0/0 |
+-----------------+----------------------------------------------------------+----------------+------+---------+------------------------+

Total database accesses: 2, total allocated memory: 64

----
