[[administration-indexes-equality-check-using-where-composite-index]]
== Equality check using `WHERE` (composite index) ==
A query containing equality comparisons for all the properties of a composite index will automatically be backed by the same index. However, the query does not need to have equality on all properties. It can have ranges and existence predicates as well. But in these cases rewrites might happen depending on which properties have which predicates, see <<administration-indexes-single-vs-composite-index, composite index limitations>>. The following query will use the composite index defined <<administration-indexes-create-a-composite-index-for-nodes, earlier>>: 

.Query
include::includes/administration-indexes-equality-check-using-where-composite-index.query.adoc[]


However, the query `MATCH (n:Person) WHERE n.age = 35 RETURN n` will not be backed by the composite index, as the query does not contain a predicate on the `country` property. It will only be backed by an index on the `Person` label and `age` property defined thus: `:Person(age)`; i.e. a single-property index. 

.Result
include::includes/administration-indexes-equality-check-using-where-composite-index.result.adoc[]

.Try this query live
include::includes/administration-indexes-equality-check-using-where-composite-index.console.adoc[]

