[[cypher-intro]]
= What is Cypher?
:description: A high-level overview of the graph query language Cypher.
:page-ad-overline-link: https://graphacademy.neo4j.com/courses/cypher-fundamentals
:page-ad-overline: Neo4j GraphAcademy
:page-ad-title: Cypher Fundamentals
:page-ad-description: Learn Cypher in this free, hands-on course
:page-ad-link: https://graphacademy.neo4j.com/courses/cypher-fundamentals
:page-ad-underline-role: button
:page-ad-underline: Learn more

[IMPORTANT]
====
This page covers the basics of Cypher.
For the complete documentation, refer to the link:{docs-home}/cypher/[Cypher Manual].
====

.A visual representation of a Cypher query
image::cypher-learning-arr.svg[role="popup-link",width=450]

Cypher is Neo4j's declarative and link:https://neo4j.com/docs/cypher-manual/current/appendix/gql-conformance/[GQL conformant] query language. 
Available as open source via link:http://openCypher.org[The openCypher project], Cypher is link:{docs-home}/cypher-manual/current/introduction/cypher-overview/#_cypher_and_sql_key_differences[similar to SQL], but optimized for graphs.

Intuitive and close to natural language, Cypher provides a visual way of matching patterns and relationships by having its own design based on ASCII-art type of syntax:

[source,cypher]
----
(:nodes)-[:ARE_CONNECTED_TO]->(:otherNodes)
----

Round brackets are used to represent `(:Nodes)`, and `-[:ARROWS]->` to represent a relationship between the `(:Nodes)`.
With this query syntax, you can perform create, read, update, or delete (CRUD) operations on your graph.

[TIP]
====
For a quick look with no installation required, get a free link:https://neo4j.com/cloud/platform/aura-graph-database/[Aura instance].
Use the graduation cap icon on the top right section to access the interactive guides.
The "Query fundamentals" gives you a hands-on introduction to Cypher.
====

== How does Cypher work?

Neo4j's graph model is composed of <<nodes>> and <<relationships>>, which may also have assigned <<properties>>.
With nodes and relationships, you can build powerful patterns that can express simple or complex patterns.

Pattern recognition is a key fundamental cognitive process, making Cypher, which utilizes pattern matching, intuitive and easy to learn.

[#cypher-syntax]
== Cypher syntax

ifndef::backend-pdf[]
++++
<div class="responsive-embed">
<iframe width="560" height="315" src="https://www.youtube.com/embed/_dup3YOZSm8" title="What is Cypher?" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
++++
endif::[]

ifdef::backend-pdf[]
link:https://www.youtube.com/watch?v=_dup3YOZSm8[What is Cypher?]
endif::[]

Cypher's constructs are based on English prose and iconography.
This makes queries easy both to write and to read.

.A graph example involving four nodes and three relationships.
image::cypherintro-graph1.svg[role="popup-link",width=600]

If you were to represent the data in this graph in English, it might read as something like: _"Sally likes Graphs. Sally is friends with John. Sally works for Neo4j."_

Now, if you were to write this same information in Cypher, then it would look like this:

[source, cypher]
----
(:Sally)-[:LIKES]->(:Graphs)
(:Sally)-[:IS_FRIENDS_WITH]->(:John)
(:Sally)-[:WORKS_FOR]->(:Neo4j)
----

However, in order to have this information in the graph, first you need to represent it as nodes and relationships.

=== Nodes

In a property graph model, the main components are nodes and relationships.
Nodes are often used to represent nouns or objects in your data model.
In the previous example, `Sally`, `John`, `Graphs`, and `Neo4j` are the nodes:

.A visual representation of nodes.
image::cypherintro-nodes.svg[role="popup-link",width=450]

In Cypher, you can depict a node by surrounding it with parentheses, e.g. `(node)`.
The parentheses are a representation of the circles that compose the nodes in the visualization.

==== Node labels

Nodes can be grouped together through a <<label>>.
They work like tags and allow you to specify certain types of entities to look for or to create.
Labels also help Cypher distinguish between entities and optimize execution for your queries.

In the example, both `Sally` and `John` can be grouped under a `Person` label, `Graphs` can receive a `Technology` label, and `Neo4j` can be labeled as `Company`:

.Nodes grouped in labels. Note that `Sally`, `John`, `Graphs`, and `Neo4j` are now xref:cypher.adoc#cypher-properties[properties] instead.
image::cypher-graph-nodes-arr.svg[role="popup-link",width=450]

In a relational database context, this would be the same as telling SQL which table to look for the particular row.
The same way you can tell SQL to query a person's information from a `Person` table, you can also tell Cypher to only check the `Person` label for that information.

[CAUTION]
====
If you do not specify a label for Cypher to filter out non-matching node categories, the query will check all of the nodes in the database.
This can affect performance in very large graphs.
====

==== Node variables

It is necessary to bind matched data entities to variables in order to reference them in subsequent clauses.

Variables can be single letters or words, and should be written in lower-case.
For example, if you want to bind all nodes labeled `Person` to the variable `p`, you write `(p:Person)`.
Likewise, if you want to use a full word, then you can write `(person:Person)`.

.Retrieve all Person nodes
[source, cypher]
----
MATCH (p:Person)
RETURN p
----

[#cypher-relationships]
=== Relationships

One of the benefits of graph databases is that you can store information about how elements (nodes) are related to each other in the form of relationships.

In Cypher, relationships are represented as square brackets and an arrow connecting two nodes (e.g. `(Node1)-[]->(Node2)`).

In the example, the lines containing `:LIKES`, `:IS_FRIENDS_WITH`, and `:WORKS_FOR` represent the relationship between the nodes:

.Graph featuring nodes and relationships.
image::cypherintro-graph1.svg[]

[NOTE]
====
Remember to always put a colon in front of a relationship type.
If you happen to forget it, and write a query such as `(:Person)-[LIKES]->(:Technology)`, `[LIKES]` will then represent a xref:cypher.adoc#_relationship_variables[relationship *variable*], not a relationship *type*.
====

==== Relationship directions

Relationships *always* have a direction which is indicated by an arrow.

They can go from left to right:

[source,cypher]
----
(p:Person)-[:LIKES]->(t:Technology)
----

From right to left:

[source,cypher]
----
(p:Person)<-[:LIKES]-(t:Technology)
----

Or be undirected (where the direction is *not* specified):

[source,cypher]
----
MATCH (p:Person)-[:LIKES]-(t:Technology)
----

==== Undirected relationships

An undirected relationship does not mean that it doesn't have a direction, but that it can be traversed in *either* direction.
While you can't *create* relationships without a direction, you can *query* them undirected (in the example, using the link:{docs-home}/cypher-manual/current/clauses/match/[`MATCH`] clause).

Using undirected relationships in queries is particularly useful when you don't know the direction, since Cypher won't return anything if you write a query with the wrong direction.
Cypher will therefore retrieve *all* nodes connected by the specified relationship type, regardless of direction.

[NOTE]
====
Because undirected relationships in queries are traversed twice (once for each direction), the same pattern will be returned twice.
This may impact the performance of the query.
====

==== Relationship types

Relationship types categorize and add meaning to a relationship, similar to how labels group nodes together.
It is considered best practice to use verbs or derivatives for the relationship type.
The type describes how the nodes relate to each other.
This way, Cypher is almost like natural language, where nodes are the subjects and objects (nouns), and the relationships (verbs) are the action words that relate them.

In the previous example, the relationship types are:

* `[:LIKES]` - communicates that Sally (a node) _likes_ graphs (another node).
* `[:IS_FRIENDS_WITH]` - communicates that Sally _is friends with_ John.
* `[:WORKS_FOR]` - communicates that Sally _works for_ Neo4j.

==== Relationship variables

Variables can be used for relationships in the same way as for nodes. 
Once you specify a variable, you can use it later in the query to reference the relationship.

Take this example:

[source,cypher]
----
MATCH (p:Person)-[r:LIKES]->(t:Technology)
RETURN p,r,t
----

This query specifies variables for both the node labels (`p` for `Person` and `t` for `Technology`) and the relationship type (`r` for `:LIKES`).
In the return clause, you can then use the variables (i.e.`p`, `r`, and `t`) to return the bound entities.

This would be your result:

.Result for the example query using node and relationship variables.
image::cypherintro-variables.svg[]

.Result
[role="queryresult",options="header,footer",cols="3*<m"]
|===
| p | r | t

| (:Person) | [:LIKES]  | (:Technology)

3+d|Rows: 1
|===

Remember to always put a colon in front of a relationship type.
If you happen to forget it, and write the query like this:

[source,cypher]
----
(Person)-[LIKES]->(Technology)
----

`[LIKES]` will represent a relationship *variable*, not a relationship *type*.
In this case, since no relationship type is declared, Cypher will search for all types of relationships in order to retrieve a result to your query.

[#cypher-properties]
=== Properties

Property values can be added both to nodes and relationships and be of a variety of data types.
For a full list of values and types, see link:{docs-home}cypher-manual/current/values-and-types/[Cypher manual -> Values and types].

Another way to organize the data in the previous example would be to add a *property*, `name`, and `Sally` and `John` as *property values* on `Person`-labeled nodes:

.Graph example with node and relationship properties.
image::cypherintro-properties.svg[]

[source,cypher]
----
CREATE (p:Person {name:'Sally'})-[r:IS_FRIENDS_WITH]->(p:Person {name:'John'})
RETURN p, r
----

Properties are enclosed by curly brackets (`{}`), the key is followed by a colon, and the value is enclosed by single or double quotation marks.

In case you have already added Sally and John as node labels, but want to change them into node properties, you need to refactor your graph.
Refactoring is a strategy in link:{docs-home}/model[data modeling] that you can learn more about in link:{docs-home}/getting-started/data-modeling/graph-model-refactoring/[this tutorial].

[#cypher-patterns]
=== Patterns in Cypher

Graph pattern matching sits at the very core of Cypher. 
It is the mechanism used to navigate, describe, and extract data from a graph by applying a declarative pattern.

Consider this example:

[source, cypher]
----
(p:Person {name: "Sally"})-[r:LIKES]->(g:Technology {type: "Graphs"})
----

This bit of Cypher represents a pattern, but it is not a query.
It only expresses that a `Person` node with _Sally_ as its `name` property has a `LIKES` relationship to the `Technology` node with _Graphs_ as its `type` property.

In order to *do* something with this pattern, such as adding it to or retrieving it from the graph, you need to *query* the database.

For example, you can add this information to the database using the link:{docs-home}/cypher-manual/current/clauses/create/[`CREATE`] clause:

[source, cypher]
----
CREATE (p:Person {name: "Sally"})-[r:LIKES]->(t:Technology {type: "Graphs"})
----

And once this data is written to the database, you can retrieve it with this pattern:

[source, cypher]
----
MATCH (p:Person {name: "Sally"})-[r:LIKES]->(t:Technology {type: "Graphs"})
RETURN p,r,t
----

=== Patterns variables

In the same way as nodes and relationships, you can also use variables for patterns.
For more information, refer to link:{docs-home}/cypher-manual/current/patterns/reference/[Cypher manual -> Patterns -> Syntax and Semantics].

== Keep learning

Now that the basic Cypher concepts have been introduced, you can take the tutorial on how to xref:appendix/tutorials/guide-cypher-basics.adoc[Get started with Cypher] to learn how to write your own queries.
In the link:{docs-home}/cypher-manual[Cypher manual], you can find more information on:

* How to write link:{docs-home}/cypher-manual/current/queries/basic/[basic queries] and what link:{docs-home}/cypher-manual/current/clauses/[clauses] you can use to read data from the database.
* How link:{docs-home}/cypher-manual/current/patterns/[patterns] work and how you can use them to navigate, describe and extract data from a graph.
* What link:{docs-home}/cypher-manual/current/values-and-types/[values and types], and link:{docs-home}/cypher-manual/current/functions/[functions] are available in Cypher.

=== From SQL to Cypher

In case you have a background in SQL and are new to graph databases, these are some resources for more information on the key differences and the transition to graphs:

* link:{docs-home}/cypher-manual/current/introduction/cypher-overview/#_cypher_and_sql_key_differences[Key differences between Cypher and SQL]
* xref:reference/graphdb-vs-rdbms[Transition from relational to graph database]
* xref:cypher-intro/cypher-sql.adoc[Reference: Comparing Cypher with SQL]
* xref:data-import/relational-to-graph-import.adoc[How-to: Import from RDBMS into graph]
* xref:data-import/import-relational-and-etl.adoc[Tutorial: Import data from a relational database into Neo4j]
* link:data-modeling/relational-to-graph-modeling.adoc[How-to: Model data from relational to graph]

=== From NoSQL to Graphs

If you are familiar with NoSQL ("Not only SQL") system, you can also learn more on xref:appendix/graphdb-concepts/graphdb-vs-nosql.adoc[how to make the transition] to a graph database.

=== GraphAcademy

With the link:https://graphacademy.neo4j.com/courses/cypher-fundamentals/[Cypher Fundamentals] course, you can learn Cypher in 60 minutes and practice using a sandbox.

=== Other resources

For more suggestions on how to expand your knowledge about Cypher, refer to xref:appendix/getting-started-resources.adoc[Resources].

ifndef::backend-pdf[]
[discrete.glossary]
endif::[]
== Glossary

include::glossary.adoc[]

ifdef::backend-pdf[]
<<<
endif::[]