[[query-functions-udf]]
= User-defined scalar functions


For each incoming row the function takes parameters and returns a single result.


This example shows how you invoke a user-defined function called `join` from Cypher.

== Call a user-defined function

This calls the user-defined function `org.neo4j.procedure.example.join()`.


.Query
[source, cypher]
----
MATCH (n:Member) RETURN org.neo4j.function.example.join(collect(n.name)) AS members
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +members+
| +"John,Paul,George,Ringo"+
1+d|Rows: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
UNWIND ["John", "Paul", "George", "Ringo"] as name CREATE (:Member {name: name})

]]></database><command><![CDATA[
MATCH (n:Member) RETURN org.neo4j.function.example.join(collect(n.name)) AS members
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]


For developing and deploying user-defined functions in Neo4j, see <<java-reference#extending-neo4j-functions, Extending Neo4j -> User-defined functions>>.

