[[query-functions-user-defined-aggregation]]
= User-defined aggregation functions

Aggregating functions consume many rows and produces a single aggregated result.

This example shows how you invoke a user-defined aggregation function called `longestString` from Cypher.

[[functions-call-a-user-defined-aggregation-function]]
== Call a user-defined aggregation function

This calls the user-defined function `org.neo4j.function.example.longestString()`.


.Query
[source, cypher]
----
MATCH (n:Member)
RETURN org.neo4j.function.example.longestString(n.name) AS member
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +member+
| +"George"+
1+d|Rows: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
UNWIND ['John', 'Paul', 'George', 'Ringe'] AS beatle
CREATE (:Member {name: beatle})

]]></database><command><![CDATA[
MATCH (n:Member)
RETURN org.neo4j.function.example.longestString(n.name) AS member
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

